app/controllers/activities_controller.rb

INSERT INTO "activities" ("email_address", "itinerary_reference", "reference_term", "name", "confirmation_number", "item_name", "start_date_time", "end_date_time", "city", "state", "country", "street_address", "zip_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
    @activity = Activity.new(activity_params)

    respond_to do |format|
      if @activity.save