app/controllers/air_posts_controller.rb

SELECT  "air_posts".* FROM "air_posts"  ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "air_posts"
---
  def index
    @air_posts = AirPost.order('created_at DESC').all.paginate(page: params[:page], per_page: 10)

INSERT INTO "air_posts" ("email_address", "itinerary_reference", "name", "airline_code", "confirmation_number", "flight_number", "arrival_date_time", "departure_date_time", "departure_airport", "arrival_airport", "gt_site_name", "gt_sub_site_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @air_post = AirPost.new(air_post_params)

    respond_to do |format|
      if @air_post.save

SELECT  "air_posts".* FROM "air_posts" WHERE "air_posts"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_air_post
      @air_post = AirPost.find(params[:id])