app/controllers/attractions_controller.rb

SELECT "attractions".* FROM "attractions"
---
  def index
    @attractions = Attraction.all

INSERT INTO "attractions" ("email_address", "itinerary_reference", "reference_term", "name", "confirmation_number", "item_name", "start_date_time", "end_date_time", "city", "state", "country", "street_address", "zip_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
    @attraction = Attraction.new(attraction_params)

    respond_to do |format|
      if @attraction.save

SELECT  "attractions".* FROM "attractions" WHERE "attractions"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_attraction
      @attraction = Attraction.find(params[:id])