app/controllers/car_rentals_controller.rb

  def index
    @car_rentals = CarRental.all
---
SELECT "car_rentals".* FROM "car_rentals"

  def create
    @car_rental = CarRental.new(car_rental_params)

    respond_to do |format|
      if @car_rental.save
---
INSERT INTO "car_rentals" ("email_address", "itinerary_reference", "reference_term", "name", "confirmation_number", "item_name", "start_date_time", "end_date_time", "city", "state", "country", "street_address", "zip_code", "lat", "long", "context", "reference", "start_date_two", "end_date_two", "context_two", "reference_two", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23) RETURNING "id"

    def set_car_rental
      @car_rental = CarRental.find(params[:id])
---
SELECT  "car_rentals".* FROM "car_rentals" WHERE "car_rentals"."id" = $1 LIMIT 1  [["id", 1]]