app/controllers/cruises_controller.rb

SELECT "cruises".* FROM "cruises"
---
  def index
    @cruises = Cruise.all