app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.all.paginate(page: params[:page], per_page: 10)

INSERT INTO "posts" ("email_address", "itinerary_reference", "name", "airline_code", "confirmation_number", "flight_number", "arrival_date_time", "departure_date_time", "departure_airport", "arrival_airport", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save